import styles from "../AboutMe/AboutMe.module.scss";
import main_bg from "../../assets/image/5_bg.jpg";

export const AboutMe = () => {
  return (
    <>
      <div
        className={styles.aboutme}
        style={{
          background: `url(${main_bg})`,
        }}
      >
        <p className={styles.text}>
          生きる意味を考えようとすると、どうしても大仰に構えてしまいますが、もっと卑近で卑小なことに意味は宿るように思えます。
        </p>
        <p className={styles.text__italic}>
          Коли ми намагаємося зрозуміти сенс життя, ми неминуче починаємо думати
          про щось величне, але, на мою думку, сенс життя криється в більш
          простих і незначних речах.
        </p>
        <br />
        <p className={styles.text}>
          誰かにとってのかけがえのない自分である必要もありません。ただ困っているひとに手を貸すだけでいいのです。
        </p>
        <p className={styles.text__italic}>
          Не обов'язково бути незамінним для когось. Достатньо просто допомогти
          тому, хто цього потребує.
        </p>
        <br />
        <p className={styles.text}>
          巣から落ちたツグミを木の上に戻すとき、わたしたちは見返りなど期待しません。困っているから助ける、というだけのことなのです。
        </p>
        <p className={styles.text__italic}>
          Коли ми повертаємо з гнізда на дерево пташку, яка з нього випала, ми
          не чекаємо нічого натомість. Ми просто допомагаємо тому, хто цього
          потребує.
        </p>
        <br />
        <p className={styles.text}>
          ツグミは鳥ですから、決して「せめてお名前だけでも」と聞いてくることもありませんし、「名乗るほどの者じゃございません」とカッコつける必要もありません。
        </p>
        <p className={styles.text__italic}>
          Дрозд — це птах, тому він ніколи не запитає: «Хоча б ім'я», і нам не
          потрібно вихвалятися, кажучи: «Я не той, хто заслуговує на те, щоб
          називати своє ім'я».
        </p>
        <br />
        <p className={styles.text}>
          そんな気持ちで誰もがひとに向き合えたら、世界はもっと良い場所になるのだろうと思います。
        </p>
        <p className={styles.text__italic}>
          Я думаю, що якби всі ставилися до людей з таким ставленням, світ став
          би кращим місцем.
        </p>
      </div>
    </>
  );
};
